Revit 2027 API
UIApplication.DisplayingOptionsDialog Event
 Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<DisplayingOptionsDialogEventArgs> DisplayingOptionsDialog
Public Event DisplayingOptionsDialog As EventHandler(Of DisplayingOptionsDialogEventArgs)
public:
 event EventHandler<DisplayingOptionsDialogEventArgs^>^ DisplayingOptionsDialog {
	void add (EventHandler<DisplayingOptionsDialogEventArgs^>^ value);
	void remove (EventHandler<DisplayingOptionsDialogEventArgs^>^ value);
}
member DisplayingOptionsDialog : IEvent<EventHandler<DisplayingOptionsDialogEventArgs>,
    DisplayingOptionsDialogEventArgs>
Value
EventHandler<DisplayingOptionsDialogEventArgs>
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace